export default function() {
    return {
        links: [
            { title: 'Басты бет' },
            { title: 'Біздің артықшылығымыз' },
            { title: 'Қызметтер' },
            { title: 'Компания жайлы' },
            { title: 'Пікірлер ' },
            { title: 'FAQ' },
        ],
        sliders: [
            { description: 'Біз сізді коллекторлардан, NPI және MFO-дан қорғаймыз' },
            { description: 'Сізді қоңыраулар мен қорқытулар мазалайды ма?' },
            { description: 'Коллекторлар сізді жұмыс пен үйде қуып жатыр ма?' },
            { description: 'Сізге моральдық қысым көрсетіліп жатыр ма?' },
            { description: 'Есептік жазбаларыңыз бұғатталды ма?' },
            { description: 'Сізге айлық шегеріммен төленеді ме?' },
            { description: 'Сіздің несие тарихыңыз бұзылды ма?' },
        ],
        we_have_a_solution: 'БІЗДЕ ШЕШІМ БАР!',
        free: 'ТЕГІН',
        protect_me: 'Мені қорғау',
    }
}
