<template>
  <div class="faq2">
    <div class="faq2__content">
      <div class="faq2__paragraph" v-for="(question,index) in faq2" :key="'UUU'+index">
        <div class="faq2__paragraph-header" v-on:click="onClickParagraph(index)">
          <span class="faq2__paragraph-header-title">{{ question.title }}</span>
          <img class="faq2__paragraph-header-arrow" src="/images/arrow.png" :style="'transform: '+question.hide.transform">
        </div>
        <div class="faq2__paragraph-body" :style="'margin: '+question.hide.margin">
          <div class="faq2__paragraph-body-content" :style="'padding: '+question.hide.padding">
            <div class="faq2__paragraph-body-content-inside" :style="'display: '+question.hide.display" v-html="question.inside"></div>
          </div>
        </div>
      </div>


<!--      <div v-for="(question,index) in faq2"-->
<!--           :class="'faq2__paragraph '+((index===0)?'faq2__paragraph-first':'')+((index===faq2.length-1)?'faq2__paragraph-last':'')"-->
<!--           :key="'UUU'+index"-->
<!--      >-->
<!--        <div :class="'faq2__paragraph-header '+((index===0)?'faq2__paragraph-header-first':'')+((index===faq2.length-1)?'faq2__paragraph-header-last':'')"-->
<!--             v-on:click="onClickParagraph(index)"-->
<!--        >-->
<!--          <span class="faq2__paragraph-title">{{ question.title }}</span>-->
<!--          <img class="faq2__paragraph-arrow" src="/images/arrow.png" :style="'transform: '+question.hide.transform">-->
<!--        </div>-->
<!--        <div class="faq2__paragraph-body">-->
<!--          <div class="faq2__paragraph-body-content" :style="'padding: '+question.hide.padding">-->
<!--            <div class="faq2__paragraph-body-content-inside" :style="'display: '+question.hide.display" v-html="question.inside">-->
<!--            </div>-->
<!--          </div>-->
<!--        </div>-->
<!--      </div>-->
    </div>
  </div>
</template>

<script>
export default {
  data () {
    return {
      faq2: [
        {
          title: 'ПОЧЕМУ КРЕДИТОР ПЕРЕДАЕТ ДОЛГ КОЛЛЕКТОРАМ?',
          inside: '<span>Кредиторы (банки, МФО) имеют право на продажу финансовых продуктов и чтобы не тратить время и ресурсы на возврат просроченных долгов, они их передают или продают коллекторским агентствам.</span>',
          hide: {
            margin: '0px',
            transform: 'rotate(0deg)',
            padding: '0px',
            display: 'none'
          },
        },
        {
          title: 'ЧТО ЗАПРЕЩЕНО ДЕЛАТЬ КОЛЛЕКТОРУ ПРИ ВЗЫСКАНИИ ЗАДОЛЖЕННОСТИ?',
          inside: '<ul>'+
              '<li>использовать иные способы взаимодействия с должником и (или) его представителем, и (или) третьим лицом, не предусмотренные законом</li>'+
              '<li>распространять сведения, порочащие честь, достоинство и деловую репутацию лица, с которым взаимодействует коллекторское агентство, либо разглашать сведения, которые могут причинить имущественный вред интересам данных лиц</li>'+
              '<li>совершать противоправные действия, посягающие на права и свободы лица, с которым взаимодействует коллекторское агентство, ставящие под угрозу их жизнь и здоровье, а также повлекшие причинение данному лицу имущественного и иного вреда</li>'+
              '<li>оказывать давление путем угрозы применения насилия либо уничтожения или повреждения имущества должника и (или) его представителя, и (или) третьих лиц, оскорбления, мошенничества, подлога документов, шантажа, принуждающее должника к выполнению обязательств по договору банковского займа или договору о предоставлении микрокредита</li>'+
              '<li>вводить лицо, с которым взаимодействует коллекторское агентство, в заблуждение относительно размера, характера и оснований возникновения задолженности</li>'+
              '<li>принимать деньги (в наличной или безналичной форме), а также иное имущество в счет погашения задолженности, за исключением случаев, когда коллекторское агентство является кредитором</li>'+
              '<li>требовать погашения задолженности иным имуществом, кроме денег</li>'+
              '<li>разглашать коммерческую или иную охраняемую <a href="https://online.zakon.kz/Document/?doc_id=1012633">законами</a> Республики Казахстан тайну, полученную от кредитора и (или) его представителя, и (или) третьих лиц, за исключением случаев, предусмотренных законами Республики Казахстан.</li>'+
              '</ul>',
          hide: {
            margin: '0px',
            transform: 'rotate(0deg)',
            padding: '0px',
            display: 'none'
          },
        },
        {
          title: 'В КАКОМ СЛУЧАЕ ВАМ, КАК ДОЛЖНИКУ МОЖЕТ ЗВОНИТЬ КОЛЛЕКТОР? В КАКОЕ ВРЕМЯ И КАК ЧАСТО?',
          inside: '<p>Коллекторское агентство вправе взаимодействовать с должником и (или) его представителем, и (или) третьим лицом, связанным обязательствами с кредитором в рамках договора банковского займа или договора о предоставлении микрокредита, способом:</p>'+
              '<ul>'+
              '<li>телефонных переговоров с телефонных номеров коллекторского агентства для контактов с должниками</li>'+
              '<li>личных встреч</li>'+
              '<li>письменных (почтовых) уведомлений, направляемых должнику - физическому лицу по месту жительства (юридическому адресу), должнику - юридическому лицу по месту нахождения (фактическому адресу)</li>'+
              '<li>текстовых, голосовых и иных сообщений по сотовой связи</li>'+
              '<li>посредством сети Интернет</li>'+
              '</ul>'+
              '<p>2. Взаимодействие коллекторского агентства с должником и (или) его представителем, и (или) третьим лицом, связанным обязательствами с кредитором в рамках договора банковского займа или договора о предоставлении микрокредита, должно осуществляться:</p>'+
              '<p>Ограничения на количество звонков, временные промежутки для звонков снимаются с коллекторов, если должник:</p>'+
              '<ul>'+
              '<li>'+
              '<p>при каждом контакте сообщением о (об):</p>'+
              '<p>наименовании коллекторского агентства и номере учетной регистрации в реестре коллекторских агентств</p>'+
              '<p>месте нахождения коллекторского агентства</p>'+
              '<p>фамилии, имени, отчестве (если оно указано в документе, удостоверяющем личность) и должности лица, которое осуществляет взаимодействие с должником</p>'+
              '<p>наименовании кредитора</p>'+
              '<p>передаче кредитором задолженности в работу коллекторскому агентству</p>'+
              '<p>структуре задолженности, остатке просроченных и текущих сумм основного долга, вознаграждения, комиссий, неустойки (штрафа, пени), предусмотренных договором банковского займа или договором о предоставлении микрокредита</p>'+
              '<p>ответственности и иных обязательствах должника, предусмотренных договором банковского займа или договором о предоставлении микрокредита, законами Республики Казахстан, а также последствиях неисполнения или ненадлежащего исполнения обязательств, предусмотренных договором банковского займа или договором о предоставлении микрокредита.</p>'+
              '</li>'+
              '<li>в период с 8.00 до 21.00 часов в будние дни по времени места жительства либо места нахождения должника, либо места регистрации должника, если иной период взаимодействия из предложенного коллекторским агентством в пределах указанного в настоящем подпункте периода времени не определен должником при личном обращении в коллекторское агентство</li>'+
              '<li>не более трех раз в неделю и не более одного раза в период с 8.00 до 21.00 часов в будние дни при личном контакте по инициативе коллекторского агентства по месту жительства или месту нахождения, или месту регистрации должника, или в помещении коллекторского агентства (филиала, представительства) по месту его нахождения</li>'+
              '<li>не более трех раз в период с 8.00 до 21.00 часов в будние дни посредством телефонных переговоров по инициативе коллекторского агентства</li>'+
              '<li>предоставлением по требованию должника документа, подтверждающего размер задолженности, и копий документов, подтверждающих полномочия коллекторского агентства по осуществлению коллекторской деятельности в отношении задолженности, за исключением информации, относящейся к коммерческой или иной охраняемой <a href="https://online.zakon.kz/Document/?doc_id=1012633">законами</a> Республики Казахстан тайне</li>'+
              '<li>фиксацией процесса взаимодействия с помощью средств аудио- или видеотехники с аудиофиксацией</li>'+
              '</ul>'+
              '<p>Ограничения на количество звонков, временные промежутки для звонков снимаются с коллекторов, если должник:</p>'+
              '<ul>'+
              '<li>отказывается контактировать с коллектором,</li>'+
              '<li>не уведомляет коллекторское агентство об изменении места жительства, об изменении имени, фамилии, отчества (если оно указано в документе, удостоверяющем личность), об изменении контактной информации, используемой для связи,</li>'+
              '<li>не раскрывает достоверную информацию об уровне доходов и расходов, информацию о месте жительства.</li>'+
              '</ul>',
          hide: {
            margin: '0px',
            transform: 'rotate(0deg)',
            padding: '0px',
            display: 'none'
          },
        },
        {
          title: 'МОЖЕТ ЛИ ЗАЁМЩИК ПЕРЕДАВАТЬ ДЕНЬГИ КОЛЛЕКТОРУ, ЧТОБЫ ПОГАСИТЬ ДОЛГ?',
          inside: '<span>Если коллекторское агентство не выкупило долг, то ему запрещено принимать от заёмщика деньги в наличной или безналичной форме, а также иное имущество в счёт погашения задолженности. Все платежи по долгу необходимо совершать только в адрес кредитора. Должник вправе требовать подтверждения статуса коллекторского агентства, как кредитора.</span>',
          hide: {
            margin: '0px',
            transform: 'rotate(0deg)',
            padding: '0px',
            display: 'none'
          },
        },
        {
          title: 'МОГУТ ЛИ КОЛЛЕКТОРЫ АРЕСТОВАТЬ ИМУЩЕСТВО ИЛИ ЗАБЛОКИРОВАТЬ КАРТОЧКУ?',
          inside: '<span>у коллекторов нет таких полномочий.  Накладывать арест, взыскивать имущество, деньги может лишь частный судебный исполнитель.</span>',
          hide: {
            margin: '0px',
            transform: 'rotate(0deg)',
            padding: '0px',
            display: 'none'
          },
        },
        {
          title: 'ЧТО ДЕЛАТЬ ЕСЛИ МАТЕРИАЛЫ ПО ВАШЕЙ ЗАДОЛЖЕННОСТИ УЖЕ ПЕРЕДАНЫ ЧАСТНОМУ СУДЕБНОМУ ИСПОЛНИТЕЛЮ?',
          inside: '<p>У частного судебного исполнителя гораздо больше полномочий, чем у коллекторов. Он может арестовать Ваше имущество, затем продать его через торги, также арестовать банковские счета в пределах суммы взыскания, установить  должнику ограничение на выезд за рубеж. Действия, совершаемые частным судебным исполнителем, подлежат обязательной оплате должником от 3% до 25% в зависимости от суммы взыскания.</p>'+
              '<p>Рекомендуем до этого не доводить, а приложить усилия для решения вопроса, чтобы он не перешел в суд.</p>'+
              '<p>Для этого нужно общаться с кредиторами и коллекторами для досудебного урегулирования просроченного долга.</p>',
          hide: {
            margin: '0px',
            transform: 'rotate(0deg)',
            padding: '0px',
            display: 'none'
          },
        },
      ]
    }
  },
  methods: {
    onClickParagraph(index) {
      if (this.faq2[index].hide.display === 'block') {
        this.faq2[index].hide.margin = '0px';
        this.faq2[index].hide.transform = 'rotate(0deg)';
        this.faq2[index].hide.padding = '0px';
        setTimeout(()=>{this.faq2[index].hide.display = 'none'},250);
      }
      else {
        this.faq2[index].hide.margin = '15px 0px 20px 0px';
        this.faq2[index].hide.transform = 'rotate(180deg)';
        this.faq2[index].hide.padding = '20px 0px 20px 0px';
        setTimeout(()=>{this.faq2[index].hide.display = 'block'},250);
      }
    },
  }
}
</script>

<style>
@import '/./css/faq2.css';
@import '/./css/mobile/faq2.css';
</style>

