export default {
  actions: {},
  mutations: {
    CHANGE_LANG(state) {
      if (state.current === 'ru') state.current = 'kz';
      else state.current = 'ru';
    }
  },
  state: {
    current: 'ru',
    ru: {
      banner: {
        title: [
          'Главная страница',
          'Наши преимущества',
          'Услуги',
          'О компании',
          'Отзывы',
          'Часто задаваемые вопросы',
        ],
        sliders: {
          description: [
            'Вас беспокоят звонками и угрозами?',
            'Вас приследует у работы и дома коллекторы?',
            'На Вас оказывают моральное давление?',
            'Ваши счета заблокировали?',
            'Вам выплачивают зп с удержаниями?',
            'Вам испортили кредитную историю?',
          ],
        },
        protectionAgainstCollectors: {
          stages: [
            [
              { num: 1, description: 'Вы оставляете заявку (анкету) на нашем сайте' },
              { num: 2, description: 'Мы ознакамливаемся с Вашей проблемой' },
            ],
            [
              { num: 3, description: 'Мы связываемся  с коллекторами и указывам им на незаконность их действий' },
              { num: 4, description: 'Мы связываемся  с МФО  и пытаемся урегулировать конфликт' },
            ],
          ],
          hideStages: [
            [
              { num: 5, description: 'мы связываемся с ЧСИ  и ведем переговоры о снятии арестов со счетов , удержании  с ЗП, о снятии ограничений на выезд' },
              { num: 6, description: 'Мы жалуемся на действие коллекторов  в НацБанк' },
            ],
            [
              { num: 7, description: 'НацБанк принимает меры  и отнимает лицензию у  неродивых коллекторов' },
              { num: 8, description: 'Мы связываемся  с МФО  и пытаемся урегулировать конфликт' },
            ],
            [
              { num: 9, description: 'НацБанк принимает меры  и сначала штрафуют МФО, а  потом отбирают лицензию' },
              { num: 10, description: 'Мы жалуемся  в Органы Юстиции на действия ЧСИ ' },
            ],
            [
              { num: 11, description: 'у ЧСИ отбирают лицензию' },
              { num: 12, description: 'Мы отменяем Нотариальную надпись' },
            ],
            [
              { num: 13, description: 'Мы жалуемся  в нотариальную палату на незаконные действия нотариуса' },
            ],
          ],
        }
      },
      we_will_protect_you_from_collectors_npi_and_mfos: 'Мы защитим Вас от Коллекторов, ЧСИ И МФО',
      we_have_a_solution: 'У НАС ЕСТЬ РЕШЕНИЕ!',
      free: 'БЕСПЛАТНО',
      protect_me: 'Защитить меня',
    },
    kz: {
      banner: {
        title: [
          'Басты бет',
          'Біздің артықшылығымыз',
          'Қызметтер',
          'Компания жайлы',
          'Пікірлер',
          'Жиі қойылатын сұрақтар',
        ],
        sliders: {
          description: [
            'Қоңыраулар мен қоқан-лоққылар сізді мазалайды ма?',
            'Сізді жұмыста және үйде коллекционерлер қуантады ма?',
            'Сізге моральдық қысым көрсетіле ме?',
            'Есептік жазбаларыңыз бұғатталды ма?',
            'Сіз жалақыны шегеріммен төлейсіз бе?',
            'Сіздің несие тарихыңыз бұзылды ма?',
          ],
        },
        protectionAgainstCollectors: {
          stages: [
            [
              { num: 1, description: 'Сіз біздің сайтта өтініш (сауалнама) қалдырасыз' },
              { num: 2, description: 'Біз сіздің мәселеңізбен танысамыз' },
            ],
            [
              { num: 3, description: 'Біз коллекторлармен байланысып, олардың әрекеттерінің заңсыздығын көрсетеміз' },
              { num: 4, description: 'Біз МҚҰ-мен байланысып, жанжалды шешуге тырысамыз' },
            ],
          ],
          hideStages: [
            [
              { num: 5, description: 'біз ЖСО-мен байланысамыз және шоттардан тыйым салуды , ЗП-дан ұстап қалуды алып тастау, шығуға шектеулерді алып тастау туралы келіссөздер жүргіземіз' },
              { num: 6, description: 'Біз Ұлттық Банкте коллекторлардың әрекетіне шағымданамыз' },
            ],
            [
              { num: 7, description: 'Ұлттық банк шаралар қабылдайды және лицензияны немқұрайды коллекторлардан алып тастайды' },
              { num: 8, description: 'Біз МҚҰ-мен байланысып, жанжалды шешуге тырысамыз' },
            ],
            [
              { num: 9, description: 'Ұлттық банк шара қолданып, алдымен МҚҰ-ға айыппұл салады, содан кейін лицензияны алады' },
              { num: 10, description: 'Біз әділет органдарына ЖСО әрекеттеріне шағымданамыз' },
            ],
            [
              { num: 11, description: 'ЖСО-дан лицензия алынады' },
              { num: 12, description: 'Біз Нотариаттық жазбадан бас тартамыз' },
            ],
            [
              { num: 13, description: 'Біз нотариаттық палатаға нотариустың заңсыз әрекеттеріне шағымданамыз' },
            ],
          ],
        }
      },
      we_will_protect_you_from_collectors_npi_and_mfos: 'Біз сізді коллекторлардан, NPI және MFO-дан қорғаймыз',
      we_have_a_solution: 'БІЗДЕ ШЕШІМ БАР!',
      free: 'ТЕГІН',
      protect_me: 'Мені қорғау',
    },
  },
  getters: {
    getLang(state) {
      if (state.current === 'ru') return state.ru;
      else return state.kz;
    },
  },
}
